{
  "reviews": [
    {
      "name": "Trey Blickle",
      "avatar": "../images/reviews/treyNew.png",
      "rating": 5,
      "text": "I love Drew's Mobile Detailing. Been using Andrew now for 2 years and whether it be a hand wash or full-blown wax/buff/detailing, he is the one I rely on. Brings his own water and supplies …"
    },
    {
      "name": "Tyler Armstrong",
      "avatar": "../images/reviews/tylerNew.png",
      "rating": 5,
      "text": "I recently had my car detailed, ceramic-coated, and paint corrected by Andrew and couldn't be happier …"
    },
    {
      "name": "Brii Zeiger",
      "avatar": "../images/reviews/briiNew.png",
      "rating": 5,
      "text": "Drew posted about his business … We decided to have Drew put us on a monthly schedule. Thank you so much Drew!"
    },
    {
      "name": "Arielle W.",
      "avatar": "../images/reviews/ariaNew.png",
      "rating": 5,
      "text": "Great experience—my car looks just as good as the day I bought it. We had intense seat stains from our toddler and now they're gone. Would absolutely use him again."
    },
    {
      "name": "Melody Clark",
      "avatar": "../images/reviews/melody.png",
      "rating": 5,
      "text": "Very, very impressed with the professionalism of Andrew and team that came to do our van! It was a mess! I mean probably one of the worst they've done and it looks brand new! They were hard workers and very polite which is huge in my book! I've already recommended them and will continue to do so! After checking other places I found they are very readonable for all they do!"
    },
    {
      "name": "Pablo Torres",
      "avatar": "../images/reviews/pablo.png",
      "rating": 5,
      "text": "Third time using Drew's Mobile Detailing, great young man. His service is excellent, full van with all the supplies needed to make you ride look new again."
    },
    {
      "name": "Steve Nach",
      "avatar": "../images/reviews/steveNach.png",
      "rating": 5,
      "text": "Andrew did an amazing job doing a 5 year ceramic coating on my new Dodge Ram. It came out beautiful!"
    },
    {
      "name": "Yoselin Manzanarez",
      "avatar": "../images/reviews/yoselin.png",
      "rating": 5,
      "text": "I called in Andrew and his team and he was able to take care of my car the same day, they performed a carpet extraction and left my car smelling/ looking brand new! He was very thorough and paid attention to every single detail. It was my first time getting a car detail and I will be booking with him in the future for any car detailing service!"
    },
    {
      "name": "Rosemary Sanders",
      "avatar": null,
      "rating": 5,
      "text": "I used Drew’s Mobile Detailing for the first time and I can definitely say I will be a repeat customer. Drew was prompt in responding to texts, prompt in showing up when he said he would and an all around respectful young man. My car looks amazing! Like brand new! No detail was overlooked in cleaning both inside and outside the car. I would definitely recommend Drew’s Mobile Detailing for your vehicle’ next detail. You won’t be disappointed."
    },
    {
      "name": "Amanda Justen",
      "avatar": null,
      "rating": 5,
      "text": "I cannot recommend Drew’s Mobile Detailing enough. I am a mom to two boys, both of whom love french fries. The toddler likes to get them everywhere. Drew’s attention to detail is superb. I cannot express how awesome it is that he has all his supplies in his van and just comes into the driveway and works. I didn’t have to plan a time that I could be stranded without a car, was able to still do normal household chores while my car was being detailed. I don’t think my car looked this clean when I first purchased it. I will be a repeat customer and recommend his services to anyone who needs a full service car detailing. His communication was prompt which I greatly appreciated. I love being able to support a local small business of a young man who works hard and is dedicated to the work he does."
    },
    {
      "name": "Chris Hurckes",
      "avatar": null,
      "rating": 5,
      "text": "I've had my car for almost 9 years and never once had it detailed. I wouldn't say it was disgusting but definitely an accumulation of dirt and debris. Drew and his team got my car looking brand new like the day I drove it off the car lot. The next day I noticed I brought a blade of grass into my car and I immediately got rid of it to keep my car looking immaculate. I would recommend Drew to anyone looking to get their car detailed. Thanks again Drew!!"
    },
    {
      "name": "Fernando Razo jr",
      "avatar": null,
      "rating": 5,
      "text": "Spotted Drew on my afternoon dog walk, working on a neighbors car. Asked him if he had any extra time, after his current client, to work on a dirty used honda crv my wife just inherited. He came by and started his 2 hour deep clean of the vehicle. He did such a thorough and professional job. Highly recommend"
    },
    {
      "name": "Kelly Freeman",
      "avatar": null,
      "rating": 5,
      "text": "Unbelievable talent! I gave them likely the worst car ever and they spent Hours in it and it was a brand new vehicle when they were done! I cannot wait to have them back again. They were polite, efficient, and so detailed!!"
    },
    {
      "name": "V Rosalee",
      "avatar": null,
      "rating": 5,
      "text": "Love supporting a small business from a young professional! Definitely worth the money and would recommend to others. I wanted my car to feel new again and that exactly what I received."
    },
    {
      "name": "Rachel",
      "avatar": null,
      "rating": 5,
      "text": "I recently had the pleasure of hiring a mobile car detailing service, and I couldn't be happier with the experience! Scheduling an appointment was a breeze; the owner was incredibly responsive and made the whole process seamless. I appreciated how easy it was to communicate with him, whether it was through text or phone calls.When he arrived at my house, I was immediately impressed by his professionalism and enthusiasm. It was clear he takes pride in his work. He went above and beyond to ensure every nook and cranny of my car was spotless. From the exterior wash to the interior vacuuming and detailing, he worked tirelessly, paying attention to every little detail. The results were simply stunning! My car looked brand new, and I couldn't believe the transformation. The attention he gave to the upholstery and dashboard was remarkable—everything felt fresh and revitalized. If you're looking for a reliable, hard-working detailer who delivers exceptional results, I highly recommend this service. I’ll definitely be calling him again for future cleanings!"
    },
    {
      "name": "Angela Schneider",
      "avatar": null,
      "rating": 5,
      "text": "Drew did an amazing job detailing my car and I am so happy with the result! The inside and outside are flawless. Working with Drew was very easy and I highly recommend his service. Amazing that he will come right to you. Will definitely use his service again!"
    },
    {
      "name": "Tammie Hester",
      "avatar": null,
      "rating": 5,
      "text": "I wanted to share publicly how happy I am w Drew's Mobile Detailing. Today 9/26/24 Andrew came out to detail my 2020 Jeep Wrangler and she is shining amazingly. I'm super fussy and I'm already recommending him to family and friends. He made my appointment that worked for me and I also love that he comes to my house. I'm giving him 5 stars...but if I could I'd give him 10+ Thank you Andrew for a job well done..and I look forward to your business"
    },
    {
      "name": "Jaclyn P",
      "avatar": null,
      "rating": 5,
      "text": "Absolutely 100% recommend Drew’s Mobile Detailing! He cleaned my truck to perfection as well as my daughter’s car! We will be on a regular schedule going forward. Thank you so much Drew!! See you soon!"
    },
    {
      "name": "Karen Watt",
      "avatar": null,
      "rating": 5,
      "text": "Just had Drew for the first time. He and his helper did a fantastic job cleaning my car -- especially the upholstery which had several stains I was fairly certain would not completely disappear.....but they did. He was on time to the minute and finished in the estimated time. I would not hesitate to have him again or to recommend him. It was definitely 5 star work. Thanks, guys!"
    },
    {
      "name": "Heather Ksiazek",
      "avatar": null,
      "rating": 5,
      "text": "Two messy kids and a heavy shedding dog didn’t stand a chance against Drew! We initially called him to help clean up a smelly mishap. He not only erased the damage from that, but also managed to give our car a good cleaning that has been sorely overdue. I would highly recommend Drew’s services to everyone!"
    },
    {
      "name": "Amy Cheung",
      "avatar": null,
      "rating": 5,
      "text": "I had Andrew come out yesterday for the first time to hand wash both of my cars and my only gripe is that I didn’t find him sooner for my car detailing needs. The mobile service that he provided was extremely efficient and he payed an immense amount of attention to detail which made both cars look brand new even though I have owned both cars for a while now. Thank you Andrew! I will be reaching out to him soon for future services and highly recommend him."
    },
    {
      "name": "Aidan Thomas",
      "avatar": null,
      "rating": 5,
      "text": "I had a 2015 supercharged Audi S5 and had an old man side swipe my car. I called Andrew right away and he got me in that day. He fixed it up perfectly! He was fast and precise with all the detailing. Had all the scratches, paint scuffs and marks out! Great service, would highly recommend."
    },
    {
      "name": "Evelyn Manzanarez",
      "avatar": null,
      "rating": 5,
      "text": "Had Andrew over to do my Toyota. He did an absolutely amazing job. I opted in for a claybar package on top of my detail and my car has never looked so shiny. Andrew was on time, had great communication, and did nothing but great work. Looking forward to having you back Andrew!"
    },
    {
      "name": "Becky Canterbury",
      "avatar": null,
      "rating": 5,
      "text": "Drew and his partner did a nice job on my small suv car. Detailed, quick and touched up the little extra things I brought to their attention (like inside the locked gas cap). I would use them again and was impressed they had their own van and electricity and I didn’t have to bother one of the residents in my apartment complex to use theirs. Stand up guys. Good to their word, would use again and recommend for anyone to give them a try!"
    },
    {
      "name": "Mikyeila Cordero",
      "avatar": null,
      "rating": 5,
      "text": "Fantastic service! They made my car look showroom-ready right in my driveway. The team was professional, thorough, and exceeded my expectations. Highly recommend for anyone wanting top-notch detailing without the hassle!"
    },
    {
      "name": "Denise Salit",
      "avatar": null,
      "rating": 5,
      "text": "Drew did such a great job! The car looks new! He was a pleasure to do business with. Thanks Drew!"
    },
    {
      "name": "Lance Rudek",
      "avatar": null,
      "rating": 5,
      "text": "I had Andrew over to do my Acura. He did a great job looks brand new. Thanks drew!"
    },
    {
      "name": "Breanna Slavik",
      "avatar": null,
      "rating": 5,
      "text": "Andrew detailed my car today, and did a fantastic job! My car looks brand new again, thank you again."
    },
    {
      "name": "Bill Wesel",
      "avatar": null,
      "rating": 5,
      "text": "Prompt and very meticulous. The whole process couldn’t have been easier. So much easier than making an appt for drop-off somewhere. Thanks Andrew!"
    },
    {
      "name": "William DeBlase",
      "avatar": null,
      "rating": 5,
      "text": "Drew did a great job. He was able to accommodate my quickness to get it done."
    },
    {
      "name": "TheClefto",
      "avatar": null,
      "rating": 5,
      "text": "Great guy, and my car looked great! Definitely worth the price"
    },
    {
      "name": "Karen Kim",
      "avatar": null,
      "rating": 5,
      "text": "Fabulous work, came on time, communication was easy and prompt thorough text. Highly recommended!"
    },
    {
      "name": "Andrzej Czarny",
      "avatar": null,
      "rating": 5,
      "text": "Great service, communication and price. Detail was perfect! Highly recommended!"
    }
  ]
}
